holymacs/look_n_feel.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Holymacs ~ Look 'n feel</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/search.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../holymacs.html"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Holymacs ~ Look 'n feel</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd28e580">Icons</a></li>
<li><a href="#orgbeb9ac3">Dashboard</a></li>
<li><a href="#orge2337bf">Beautify</a></li>
<li><a href="#org1f7fc3b">Highlight line</a></li>
<li><a href="#orgae8d864">Themes</a></li>
<li><a href="#org1dce9ed">Modeline</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgd28e580" class="outline-2">
<h2 id="orgd28e580">Icons</h2>
<div class="outline-text-2" id="text-orgd28e580">
<div class="org-src-container">
<pre class="src src-elisp">(use-package all-the-icons)
(use-package all-the-icons-gnus
  :config
  (all-the-icons-gnus-setup))
(use-package all-the-icons-dired
  :hook
  (dired-mode . all-the-icons-dired-mode))
(use-package all-the-icons-ibuffer
  :hook
  (ibuffer-mode . all-the-icons-ibuffer-mode))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbeb9ac3" class="outline-2">
<h2 id="orgbeb9ac3">Dashboard</h2>
<div class="outline-text-2" id="text-orgbeb9ac3">
<div class="org-src-container">
<pre class="src src-elisp">(use-package dashboard
  :config
  (dashboard-setup-startup-hook)
  :bind
  (:map dashboard-mode-map
        ("n" . #'widget-forward)
        ("p" . #'widget-backward))
  :custom
  (dashboard-week-agenda t)
  (dashboard-icon-type 'all-the-icons)
  (dashboard-set-file-icons t)
  (dashboard-set-heading-icons t)
  (dashboard-navigation-cycle t)
  (dashboard-items '((recents   . 5)
                     (bookmarks . 5)
                     (projects  . 5)
                     (agenda    . 5)
                     (registers . 5)))
  (dashboard-item-shortcuts '((recents   . "r")
                              (bookmarks . "m")
                              (projects  . "p")
                              (agenda    . "a")
                              (registers . "e"))))
</pre>
</div>
</div>
</div>
<div id="outline-container-orge2337bf" class="outline-2">
<h2 id="orge2337bf">Beautify</h2>
<div class="outline-text-2" id="text-orge2337bf">
<div class="org-src-container">
<pre class="src src-elisp">(use-package org-modern
  :config
  (global-org-modern-mode))
</pre>
</div>
</div>
</div>
<div id="outline-container-org1f7fc3b" class="outline-2">
<h2 id="org1f7fc3b">Highlight line</h2>
<div class="outline-text-2" id="text-org1f7fc3b">
<div class="org-src-container">
<pre class="src src-elisp">(use-package beacon
  :config
  (beacon-mode 1))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgae8d864" class="outline-2">
<h2 id="orgae8d864">Themes</h2>
<div class="outline-text-2" id="text-orgae8d864">
<div class="org-src-container">
<pre class="src src-elisp">(use-package ef-themes
  :config
  (defun get-season (month)
    (cond
     ((and (&gt;= month 3) (&lt; month 6)) 'spring)
     ((and (&gt;= month 6) (&lt; month 9)) 'summer)
     ((and (&gt;= month 10) (&lt; month 12)) 'autumn)
     ((or (&gt;= month 12) (&lt; month 3) 'winter))))

  (defun set-season-theme ()
    (interactive)
    (let* ((month (car (calendar-current-date)))
           (season (get-season month))
           (theme-name (format "ef-%s" season)))
      (load-theme (intern theme-name)))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org1dce9ed" class="outline-2">
<h2 id="org1dce9ed">Modeline</h2>
<div class="outline-text-2" id="text-org1dce9ed">
<p>
Install the <code>doom-modeline</code>.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(use-package doom-modeline
  :hook (after-init . doom-modeline-mode))
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-06-20 Thu 00:00</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.1 (<a href="https://orgmode.org">Org</a> mode 9.7.11)</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
